### Terraform plan 
<details><summary>Click to see the plan</summary>


```diff

[command]/home/runner/work/_temp/ee0b3195-12ee-4321-bd69-5b8b86ffa8e6/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["ex-single"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "aws-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::322620855520:user/caio"
      + tags              = {
          + "project" = "aws-eks-cluster"
        }
      + tags_all          = {
          + "project" = "aws-eks-cluster"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["ex-single_single"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "aws-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::322620855520:user/caio"

      + access_scope {
          + type = "cluster"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.eks.aws_eks_access_entry.this["ex-single"] will be created%0A  + resource "aws_eks_access_entry" "this" {%0A      + access_entry_arn  = (known after apply)%0A      + cluster_name      = "aws-eks-cluster"%0A      + created_at        = (known after apply)%0A      + id                = (known after apply)%0A      + kubernetes_groups = (known after apply)%0A      + modified_at       = (known after apply)%0A      + principal_arn     = "arn:aws:iam::322620855520:user/caio"%0A      + tags              = {%0A          + "project" = "aws-eks-cluster"%0A        }%0A      + tags_all          = {%0A          + "project" = "aws-eks-cluster"%0A        }%0A      + type              = "STANDARD"%0A      + user_name         = (known after apply)%0A    }%0A%0A  # module.eks.aws_eks_access_policy_association.this["ex-single_single"] will be created%0A  + resource "aws_eks_access_policy_association" "this" {%0A      + associated_at = (known after apply)%0A      + cluster_name  = "aws-eks-cluster"%0A      + id            = (known after apply)%0A      + modified_at   = (known after apply)%0A      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"%0A      + principal_arn = "arn:aws:iam::322620855520:user/caio"%0A%0A      + access_scope {%0A          + type = "cluster"%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
 

```
</details>
